type Realm = {
    name: string;
    detail: string;
};

export const hells: Realm[] = [
    {
        name: 'สัญชีวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลจับตรึงกับพื้นแล้วนายนริยบาลก็ใช้ มีด หอก ดาบ ฟันแทงร่างกายสัตว์นรกจนฉีกขาดเป็นชิ้นๆ สัตว์นรกต้องทนทุกข์ทรมานเวียนตายเวียนเกิดอย่างไม่รู้จบสิ้น บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีจิตใจทารุณโหดเหี้ยม ทำบาปกรรมฆ่าสัตว์เป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสี่พันห้าร้อยล้าน (4,500,000,000) ปีมนุษย์ หรือ 500 ปีนรก',
    },
    {
        name: 'กาฬสุตมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกนายนริยบาลนำเลื่อยเหล็กร้อนตัดที่มือทั้งสองของสัตว์นรกจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนโลภมาก ชอบลักขโมยของของผู้อื่นโดยเจ้าของมิได้ให้เป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสามหมื่นหกพันล้าน (36,000,000,000) ปีมนุษย์ หรือ 1,000 ปีนรก',
    },
    {
        name: 'สังฆาฏมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลใช้มีดตัดหรือแทงเข้าไปในอวัยวะเพศของสัตว์นรกจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนมักมากในกาม เป็นคนเจ้าชู้ผิดลูกผิดเมียผู้อื่น ชอบประพฤติผิดในกามเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสองแสนเก้าหมื่นล้าน (290,000,000,000) ปีมนุษย์ หรือ 2,000 ปีนรก',
    },
    {
        name: 'โรรุวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลใช้คีมเหล็กร้อนกระชากลิ้นออกมาตัดแล้วเฆี่ยนตีด้วยแส้เหล็กร้อนจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนชอบพูดเท็จ พูดส่อเสียด พูดคำหยาบเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลา เก้าแสนสามหมื่นหกพันล้าน (936,000,000,000) ปีมนุษย์ หรือ 4,000 ปีนรก',
    },
    {
        name: 'มหาโรรุวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลจับตรึงกับพื้นแล้วนายนริยบาลก็นำกระบวยเหล็กร้อนที่ตักจากลำธารน้ำกรดสีดำร้อน มากรอกใส่ปากของสัตว์นรกจนเต็มท้องน้ำกรดก็จะกัดกินร่างของสัตว์นรกจนแหลกเหลวและตายในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนชอบดื่มสุราเมรัยหรือยาเสพติดเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาเจ็ดหมื่นสามพันล้านเจ็ดแสนสองหมื่นแปดพันล้านล้าน (73,000,728,000,000,000) ปีมนุษย์ หรือ 8,000 ปีนรก',
    },
    {
        name: 'ตาปนมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้เมื่อมาสู่ในนรกกรรมก็จะบันดาลให้มีฝน อุปกรณ์การเล่นพนัน เหรียญและธนบัตร ที่เป็นเหล็กร้อนมีความคม ตกใส่ร่างสัตว์นรกจนแหลกเหลวและตาย ในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นที่ติดการเล่นการพนันอย่างเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลา สองพันเก้าร้อยสี่สิบเจ็ดล้านสามแสนเก้าหมื่นสองพันล้านล้านปีมนุษย์ (2,947,392,000,000,000) หรือ 16,000 ปีนรก',
    },
    {
        name: 'มหาตาปนมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนิรยบาลทั้งหลายใช้หอกไล่แทงสัตว์นรกให้ปีนขึ้นไปบนภูเขาไฟนรก แต่พอขึ้นไปถึงยอดภูเขาแล้ว มีลมนรกเกิดขึ้น เป็นลมพัดมาโดยรอบจนทำให้ สัตว์นรกเหล่านั้นตกลงมาจากยอดภูเขานั้น แต่พอตกลงมายังไม่ทันถึงพื้นดิน หลาวเหล็กร้อนก็ผุดขึ้นเสียบร่างกายสัตว์นรกเหล่านั้นจนแหลกเหลวและตายในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติเป็นคนชอบเที่ยวกลางคืนมัวเมาในอบายมุขทุกชนิด สัตว์นรกนี้ต้องรับโทษเป็นเวลาครึ่งกัลป์หรือคือเวลาอันประมาณมิได้',
    },
    {
        name: 'อเวจีมหานรก',
        detail:
            'สัตว์นรกในนรกในนรกขุมนี้จะไปถูกเผาอยู่ในห้องเหล็กร้อนมีเหล็กแหลมร้อนพุ่งออกมาจากกำแพงเหล็กทั้งหกด้านแทงทะลุร่างกายตรึงเอาไว้ถูกเผาไหม้ให้ทุรนทุรายอยู่อย่างนั้นไม่รู้จักตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติได้ทำอนันตริยกรรมเอาไว้ ประกอบด้วย ฆ่าพ่อ ฆ่าแม่ ฆ่าพระอรหันต์ ทำพระพุทธเจ้าให้ห้อพระโลหิต และ ทำสังฆเภท หรือ ทำให้หมู่สงฆ์แตกกัน หรือทำกรรมของการฆ่าสัตว์ตัดชีวิตเป็นอาจิณอย่างไม่มีวันว่างเว้นจนจัดว่าเป็นกรรมหนัก สัตว์นรกนี้ต้องรับโทษเป็นเวลาหนึ่งกัลป์หรือคือเวลาอันประมาณมิได้',
    },
];

export const heavens: Realm[] = [];

export const mortal: Realm[] = [
    {
        name: 'โลกมนุษย์',
        detail: 'ชุบทีมีใบ',
    },
    {
        name: 'โลกแฟนตาซี',
        detail: 'ขอให้โชคดีมีชัยในโลกแฟนตาซี!!',
    },
];
