import md5 from 'md5';

export type Realm = {
    name: string;
    detail: string;
};

const hells: Realm[] = [
    {
        name: 'สัญชีวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลจับตรึงกับพื้นแล้วนายนริยบาลก็ใช้ มีด หอก ดาบ ฟันแทงร่างกายสัตว์นรกจนฉีกขาดเป็นชิ้นๆ สัตว์นรกต้องทนทุกข์ทรมานเวียนตายเวียนเกิดอย่างไม่รู้จบสิ้น บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีจิตใจทารุณโหดเหี้ยม ทำบาปกรรมฆ่าสัตว์เป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสี่พันห้าร้อยล้าน (4,500,000,000) ปีมนุษย์ หรือ 500 ปีนรก',
    },
    {
        name: 'กาฬสุตมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกนายนริยบาลนำเลื่อยเหล็กร้อนตัดที่มือทั้งสองของสัตว์นรกจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนโลภมาก ชอบลักขโมยของของผู้อื่นโดยเจ้าของมิได้ให้เป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสามหมื่นหกพันล้าน (36,000,000,000) ปีมนุษย์ หรือ 1,000 ปีนรก',
    },
    {
        name: 'สังฆาฏมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลใช้มีดตัดหรือแทงเข้าไปในอวัยวะเพศของสัตว์นรกจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนมักมากในกาม เป็นคนเจ้าชู้ผิดลูกผิดเมียผู้อื่น ชอบประพฤติผิดในกามเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาสองแสนเก้าหมื่นล้าน (290,000,000,000) ปีมนุษย์ หรือ 2,000 ปีนรก',
    },
    {
        name: 'โรรุวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลใช้คีมเหล็กร้อนกระชากลิ้นออกมาตัดแล้วเฆี่ยนตีด้วยแส้เหล็กร้อนจนตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนชอบพูดเท็จ พูดส่อเสียด พูดคำหยาบเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลา เก้าแสนสามหมื่นหกพันล้าน (936,000,000,000) ปีมนุษย์ หรือ 4,000 ปีนรก',
    },
    {
        name: 'มหาโรรุวมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนริยบาลจับตรึงกับพื้นแล้วนายนริยบาลก็นำกระบวยเหล็กร้อนที่ตักจากลำธารน้ำกรดสีดำร้อน มากรอกใส่ปากของสัตว์นรกจนเต็มท้องน้ำกรดก็จะกัดกินร่างของสัตว์นรกจนแหลกเหลวและตายในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นคนชอบดื่มสุราเมรัยหรือยาเสพติดเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลาเจ็ดหมื่นสามพันล้านเจ็ดแสนสองหมื่นแปดพันล้านล้าน (73,000,728,000,000,000) ปีมนุษย์ หรือ 8,000 ปีนรก',
    },
    {
        name: 'ตาปนมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้เมื่อมาสู่ในนรกกรรมก็จะบันดาลให้มีฝน อุปกรณ์การเล่นพนัน เหรียญและธนบัตร ที่เป็นเหล็กร้อนมีความคม ตกใส่ร่างสัตว์นรกจนแหลกเหลวและตาย ในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติ มีเป็นที่ติดการเล่นการพนันอย่างเป็นอาจิณ สัตว์นรกนี้ต้องรับโทษเป็นเวลา สองพันเก้าร้อยสี่สิบเจ็ดล้านสามแสนเก้าหมื่นสองพันล้านล้านปีมนุษย์ (2,947,392,000,000,000) หรือ 16,000 ปีนรก',
    },
    {
        name: 'มหาตาปนมหานรก',
        detail:
            'สัตว์นรกในนรกขุมนี้จะถูกเหล่านายนิรยบาลทั้งหลายใช้หอกไล่แทงสัตว์นรกให้ปีนขึ้นไปบนภูเขาไฟนรก แต่พอขึ้นไปถึงยอดภูเขาแล้ว มีลมนรกเกิดขึ้น เป็นลมพัดมาโดยรอบจนทำให้ สัตว์นรกเหล่านั้นตกลงมาจากยอดภูเขานั้น แต่พอตกลงมายังไม่ทันถึงพื้นดิน หลาวเหล็กร้อนก็ผุดขึ้นเสียบร่างกายสัตว์นรกเหล่านั้นจนแหลกเหลวและตายในที่สุด บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติเป็นคนชอบเที่ยวกลางคืนมัวเมาในอบายมุขทุกชนิด สัตว์นรกนี้ต้องรับโทษเป็นเวลาครึ่งกัลป์หรือคือเวลาอันประมาณมิได้',
    },
    {
        name: 'อเวจีมหานรก',
        detail:
            'สัตว์นรกในนรกในนรกขุมนี้จะไปถูกเผาอยู่ในห้องเหล็กร้อนมีเหล็กแหลมร้อนพุ่งออกมาจากกำแพงเหล็กทั้งหกด้านแทงทะลุร่างกายตรึงเอาไว้ถูกเผาไหม้ให้ทุรนทุรายอยู่อย่างนั้นไม่รู้จักตาย บาปกรรมที่ทำให้ตกนรกขุมนี้เนื่องมาจากในอดีตชาติได้ทำอนันตริยกรรมเอาไว้ ประกอบด้วย ฆ่าพ่อ ฆ่าแม่ ฆ่าพระอรหันต์ ทำพระพุทธเจ้าให้ห้อพระโลหิต และ ทำสังฆเภท หรือ ทำให้หมู่สงฆ์แตกกัน หรือทำกรรมของการฆ่าสัตว์ตัดชีวิตเป็นอาจิณอย่างไม่มีวันว่างเว้นจนจัดว่าเป็นกรรมหนัก สัตว์นรกนี้ต้องรับโทษเป็นเวลาหนึ่งกัลป์หรือคือเวลาอันประมาณมิได้',
    },
];

const heavens: Realm[] = [
    {
        name: 'จาตุมหาราชิกา',
        detail:
            'ตั้งอยู่ ณ เชิงเขาพระสุเมรุ ที่ได้ชื่อสวรรค์ชั้นจาตุมหาราชิกา เพราะมีเทพผู้เป็นใหญ่ครองสวรรค์ชั้นนี้อยู่ 4 ท่าน คือ ท้าวธตรฐปกครองพวกคนธรรพ์ ท้าววิรุฬหกปกครองพวกกุมภัณฑ์ ท้าววิรูปักษ์ปกครองพวกนาค ท้าวเวสสุวรรณปกครองพวกยักษ์',
    },
    {
        name: 'ดาวดึงส์',
        detail:
            'ตั้งอยู่ที่บนยอดเขาพระสุเมรุ ที่ชื่อว่า ดาวดึงส์ เพราะเป็นที่อยู่ของเทพผู้ปกครองภพถึง 33 องค์ โดยมีท้าวสักกะเป็นประธาน และที่สำคัญมีจุฬามณีเจดีย์ ซึ่งทุกวันพระเทวดาจะมาประชุมกันที่ศาลาสุธรรมา เพื่อรับฟังโอวาทจากท้าวสักกะ',
    },
    {
        name: 'ยามา',
        detail:
            'พระโคตมพุทธเจ้าตรัสถึงสวรรค์ชั้นยามา ว่าเป็นสวรรค์ชั้นที่ 3 อยู่สูงกว่าดาวดึงส์ แต่ต่ำกว่าดุสิต มีท้าวสุยามะเป็นจอมเทพ ไตรภูมิพระร่วงระบุว่าสวรรค์ชั้นยามาอยู่สูงกว่าดาวดึงส์ไป 84,000 โยชน์ เทวดาในชั้นนี้มีปราสาทแก้ว ปราสาททอง ล้อมรอบด้วยกำแพงแก้ว มีสวน สระบัวสวยงาม เทวดามีกายสูง 8,000 วา เนื่องจากสวรรค์ชั้นนี้อยู่สูงมาก แสงอาทิตย์จึงส่องมาไม่ถึง แต่สวรรค์ชั้นนี้ก็ไม่เคยมืดเพราะมีรัสมีจากกายของเทวดาส่องให้ทั้งภูมินี้สว่างไสวอยู่ตลอดเวลา เมื่อจะกำหนดวันคืน เทวดาในชั้นนี้จะดูจากดอกไม้ทิพย์ หากดอกไม้บานแสดงว่าเป็นเวลารุ่งเช้า หากดอกไม้หุบเป็นเวลากลางคืน',
    },
    {
        name: 'ดุสิต',
        detail:
            'พระโคตมพุทธเจ้าตรัสถึงสวรรค์ชั้นดุสิต ว่าเป็นสวรรค์ชั้นที่ 4 อยู่สูงกว่ายามา แต่ต่ำกว่านิมมานรดี มีท้าวสันดุสิตเป็นจอมเทพ ไตรภูมิพระร่วงระบุว่าสวรรค์ชั้นนี้อยู่สูงกว่าชั้นยามาไป 168,000 โยชน์ มีปราสาทแก้ว ปราสาททอง ล้อมรอบด้วยกำแพงแก้ว มีสวน สระบัวสวยงามยิ่งกว่าสวรรค์ชั้นที่อยู่ต่ำกว่า เป็นที่ประทับของพระโพธิสัตว์ทั้งหลายและว่าที่พระอัครสาวก ในปัจจุบันพระศรีอริยเมตไตรยและว่าที่พระอัครสาวกของพระองค์จึงประทับอยู่ ณ ภูมินี้',
    },
    {
        name: 'นิมมานรดี',
        detail:
            'พระโคตมพุทธเจ้าตรัสถึงสวรรค์ชั้นนิมมานรดี ว่าเป็นสวรรค์ชั้นที่ 5 อยู่สูงกว่าชั้นดุสิต แต่ต่ำกว่าชั้นปรนิมมิตวสวัตดี มีท้าวสุนิมมิตเป็นจอมเทพ ไตรภูมิพระร่วงระบุว่าสวรรค์ชั้นนี้อยู่สูงกว่าชั้นดุสิตไป 336,000 โยชน์ มีวิมานทอง กำแพงแก้ว กำแพงทองล้อมรอบ แผ่นดินเป็นทองราบเรียบเสมอกันโดยตลอด เทวดาในชั้นนี้ปรารถนายินดีในสิ่งใดก็สามารถเนรมิตขึ้นมาได้เองตามปรารถนาทุกประการ จึงได้ชื่อว่า "นิมมานรดี" (ยินดีในการเนรมิต)',
    },
    {
        name: 'ปรนิมมิตวสวัตดี',
        detail:
            'พระโคตมพุทธเจ้าตรัสถึงสวรรค์ชั้นปรนิมมิตวสวัตดี ว่าเป็นสวรรค์ชั้นที่ 6 อยู่สูงกว่านิมมานรดี แต่ต่ำกว่าพรหมภูมิ มีท้าววสวัตดีเป็นจอมเทพเพียงพระองค์เดียว ไตรภูมิพระร่วงระบุว่าสวรรค์ชั้นนี้อยู่สูงกว่านิมมานรดีไป 672,000 โยชน์ และระบุต่างจากพระไตรปิฎกว่าสวรรค์ชั้นนี้มีจอมเทพสององค์คือ ท้าวปรนิมมิตวสวัตดีเทวราชและพญามาราธิราช หากว่าเทวดาในสวรรค์ชั้นนี้ปรารถนาสิ่งใดก็ไม่ต้องเนรมิตขึ้นเอง แต่จะมีเทวดาองค์อื่นมาเนรมิตให้ จึงได้ชื่อว่า "ปรนิมมิต" (ผู้อื่นเนรมิต)',
    },
];

const mortals: Realm[] = [
    {
        name: 'โลกมนุษย์',
        detail: 'ชุบทีมีใบ',
    },
    {
        name: 'โลกแฟนตาซี',
        detail: 'ขอให้โชคดีมีชัยในโลกแฟนตาซี!!',
    },
];

export function getRandomInt(min: number, max: number) {
    return Math.floor(min + Math.random() * (max - min + 1));
}

export function getHashed(str: string) {
    const hashed: string = md5(str).slice(0, 8);
    return parseInt(hashed);
}

export function getRealm(index: number): Realm {
    if (index > 0) {
        return heavens[index - 1];
    } else if (index < 0) {
        return hells[-index - 1];
    } else {
        return mortals[getRandomInt(0, 1)];
    }
}
